benchmark_20260118_131028/node_GET_50c__api_users_ab.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /api/users
Document Length:        99 bytes

Concurrency Level:      50
Time taken for tests:   14.111 seconds
Complete requests:      10000
Failed requests:        0
Keep-Alive requests:    10000
Total transferred:      3340000 bytes
HTML transferred:       990000 bytes
Requests per second:    708.68 [#/sec] (mean)
Time per request:       70.553 [ms] (mean)
Time per request:       1.411 [ms] (mean, across all concurrent requests)
Transfer rate:          231.15 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   3.3      0      73
Processing:    19   70  14.9     62     225
Waiting:        7   70  14.9     62     225
Total:         20   70  15.3     62     240

Percentage of the requests served within a certain time (ms)
  50%     62
  66%     70
  75%     77
  80%     79
  90%     92
  95%    100
  98%    113
  99%    120
 100%    240 (longest request)